// Створи функцію getProducts, яка запускається кожного разу після того, як користувач не вводить нічого 300 мілісекунд. Є масив продуктів, у цьому масиві потрібно здійснювати пошук, та рендерити ті продукти, які починаються з тих букв, які користувач ввів в полі ввода.
const products = [
  { name: 'Apple', img: '🍎' },
  { name: 'Pear', img: '🍐' },
  { name: 'Mango', img: '🥭' },
  { name: 'Cherry', img: '🍒' },
  { name: 'Kiwi', img: '🥝' },
  { name: 'Lemon', img: '🍋' },
  { name: 'Pineapple', img: '🍍' },
  { name: 'Orange', img: '🍊' },
];
