// Модуль 1. Заняття 2. Розгалуження. Цикли
// Блок 1 - Розгалудження
// 1. Напишіть функцію bmi, яка обчислює індекс маси тіла (bmi = weight / height ^ 2)
// якщо менше аніж 18.5 => "Недостатня вага"
// якщо менше або дорівнює 25.0 => "Норма"
// якщо менше або дорівнює 30.0 return => "Надмірна вага"
// якщо більше 30 return => "Ожиріння"
// function calculateBMI(weight, height) {
//   const BMI = (weight / height ** 2).toFixed(2);
//   console.log(BMI);
//   if (BMI < 18.5) {
//     return `Недостатня вага`;
//   } else if (18.5 <= BMI && BMI <= 25.0) {
//     return `Норма`;
//   } else if (BMI > 25 && BMI <= 30) {
//     return `Надмірна вага`;
//   } else {
//     return `Ожиріння`;
//   }
// }
// console.log(calculateBMI(75, 1.73));
// console.log(calculateBMI(40, 1.78));
// console.log(calculateBMI(120, 1.58));

/////////////////////////////////////////////////////////////////////////////////////////
// 2. Cтворити функцію, яка обчислюватиме потрібну кількість калорій на день, для тих, хто хоче набрати або скинути вагу.
// Формула для розрахунку денної норми калорій: Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) − 161 - (10 × (вага - бажана вага)). Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 5 - (10 × (вага - бажана вага)).

// function calculateDailyCalorieRate(weight, height, gender, age, desiredWeight) {
//   if (gender === `female`) {
//     return (
//       10 * weight +
//       (6, 25 * height) -
//       5 * age -
//       161 -
//       10 * (weight - desiredWeight)
//     );
//   }
//   return (
//     10 * weight + (6, 25 * height) - 5 * age + 5 - 10 * (weight - desiredWeight)
//   );
// }
// console.log(calculateDailyCalorieRate(55, 167, 'female', '25', 52));
// console.log(calculateDailyCalorieRate(93, 180, 'male', '34', 87));
///////////////////////////////////////////////////////////////////////////////////////////
// 3. Напиши скрипт, який виконує наступний функціонал:
// На рахунку користувача є 23580 кредитів, значення зберігається в змінній credits (створи і привласни). Користувач вирішує купити ремонтних дроїд, які коштують по 3000 кредитів за штуку. Ціна одного дроїда зберігається в змінній pricePerDroid (створи і привласни).

// При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість дроїдів, які користувач хоче купити і зберегти в змінну.

// Напиши скрипт який:

// Якщо в prompt була натиснута кнопка Cancel, виводить в консоль повідомлення 'Скасовано користувачем!'.
// В іншому випадку, розраховує загальну ціну замовлення і зберігає в змінній totalPrice.
// Перевіряє чи зможе користувач оплатити замовлення:
// якщо сума до оплати перевищує кількість кредитів на рахунку, виводь в консоль повідомлення 'Недостатньо коштів на рахунку!'.
// в іншому випадку необхідно порахувати залишок кредитів на рахунку і вивести повідомлення 'Ви купили [число] дроїдів, на рахунку залишилося [число] кредитів.'.

// const credits = 23580;
// const pricePerDroid = 3000;
// const numbsOfDroids = prompt('How many droids do you nead?');
// if (numbsOfDroids === null) {
//   console.log('Скасовано користувачем!');
// }
// let totalPrise = numbsOfDroids * pricePerDroid;
// if (totalPrise > credits) {
//   console.log('Недостатньо коштів на рахунку!');
// } else {
//   let creditsLast = credits - totalPrise;
//   console.log(
//     `Ви купили ${numbsOfDroids} дроїдів, на рахунку залишилося  ${creditsLast} кредитів.`,
//   );
// }
////////////////////////////////////////////////////////////////////////////////////////////////
// // 4. Напиши функцію, яка виконує арифметичні дії над двома числами. Використовуй switch
// function evalNumbers(num1, num2, operation) {
//   switch (operation) {
//     case 'add':
//       return num1 + num2;
//     case 'subtract':
//       return num1 - num2;
//     case 'multiply':
//       return num1 * num2;
//     case 'divide':
//       return num1 / num2;
//     default:
//       return 'Uknown operator';
//   }
// }

// console.log(evalNumbers(1, 2, 'add')); // cума чисел = 3
// console.log(evalNumbers(2, 8, 'subtract')); // різниця чисел = -6
// console.log(evalNumbers(2, 4, 'multiply')); // добуток чисел = 8
// console.log(evalNumbers(28, 7, 'divide')); // ділення чиел = 4
//////////////////////////////////////////////////////////////////////////////////////////////////////
// 5. Напиши скрипт, який імітує авторизацію адміністратора в панелі управління.
// Є змінна message в яку буде записано повідомлення про результат. При завантаженні сторінки у відвідувача запитується login через prompt:

// Якщо відвідувач вводить "ADMIN", то prompt запитує password
// Якщо нічого не введено - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Користувача з таким логіном [введений логін] не існує"
// Пароль перевіряти так:

// Якщо введено пароль "jqueryismyjam", то вивести рядок "Привіт ADMIN!"
// Інакше виводити рядок "Невірний пароль"
// Якщо 3 рази поспіль було введено направильно пароль, виводчити повідомлення що "Ваш акаунт тимчасово заблокований!"
// const ADMIN_LOGIN = "ADMIN";
// const ADMIN_PASSWORD = "jqueryismyjam";

/////////////////////////////////////////////////////////////////////////////////////////////////

// Блок 2 - Цикли
// 1. Вивести числа у зворотньому порядку починаючи з 10, коли цикл дійде до нуля, показати повідомлення "Час вийшов"
// for (let index = 10; index >= 0; index -= 1) {
//   if (index === 0) {
//     console.log('Час вийшов');
//     break;
//   }
//   console.log(index);
// }

////////////////////////////////////////////////////////////////////////////////////////////////
// 4. Порахуй скільки голосних букв у реченні.

// function countVowel(str) {
//   const vowels = ['a', 'e', 'i', 'o', 'u'];
//   let numberOfVowels = 0;
//   for (let i = 0; i < str.length; i += 1) {
//     console.log(str[i]);
//     const letter = str[i].toLowerCase();
//     if (vowels.includes(letter)) {
//       numberOfVowels += 1;
//     }
//   }
//   return numberOfVowels;
// }
// console.log(countVowel('HELLO WORLD')); // 3
// console.log(countVowel('Junior Web Developer')); // 8
// console.log(countVowel('knowlage is a power')); // 7
